Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA102.h
#define _REFOCON_RODIV0_POSITION                 0x00000008
#define _REFOCON_RODIV0_MASK                     0x00000100
#define _REFOCON_RODIV0_LENGTH                   0x00000001

#define _REFOCON_RODIV1_POSITION                 0x00000009
#define _REFOCON_RODIV1_MASK                     0x00000200
#define _REFOCON_RODIV1_LENGTH                   0x00000001

#define _REFOCON_RODIV2_POSITION                 0x0000000A
#define _REFOCON_RODIV2_MASK                     0x00000400
#define _REFOCON_RODIV2_LENGTH                   0x00000001

#define _REFOCON_RODIV3_POSITION                 0x0000000B
#define _REFOCON_RODIV3_MASK                     0x00000800
#define _REFOCON_RODIV3_LENGTH                   0x00000001

#define _REFOCON_ROON_POSITION                   0x0000000F
#define _REFOCON_ROON_MASK                       0x00008000
#define _REFOCON_ROON_LENGTH                     0x00000001

#define _DSCON_RELEASE_POSITION                  0x00000000
#define _DSCON_RELEASE_MASK                      0x00000001
#define _DSCON_RELEASE_LENGTH                    0x00000001

#define _DSCON_DSBOR_POSITION                    0x00000001
#define _DSCON_DSBOR_MASK                        0x00000002
#define _DSCON_DSBOR_LENGTH                      0x00000001

#define _DSCON_DSEN_POSITION                     0x0000000F
#define _DSCON_DSEN_MASK                         0x00008000
#define _DSCON_DSEN_LENGTH                       0x00000001

#define _DSWAKE_DSPOR_POSITION                   0x00000000
#define _DSWAKE_DSPOR_MASK                       0x00000001
#define _DSWAKE_DSPOR_LENGTH                     0x00000001

#define _DSWAKE_DSMCLR_POSITION                  0x00000002
#define _DSWAKE_DSMCLR_MASK                      0x00000004
#define _DSWAKE_DSMCLR_LENGTH                    0x00000001

#define _DSWAKE_DSRTC_POSITION                   0x00000003
#define _DSWAKE_DSRTC_MASK                       0x00000008
#define _DSWAKE_DSRTC_LENGTH                     0x00000001

#define _DSWAKE_DSWDT_POSITION                   0x00000004
#define _DSWAKE_DSWDT_MASK                       0x00000010
#define _DSWAKE_DSWDT_LENGTH                     0x00000001

#define _DSWAKE_DSFLT_POSITION                   0x00000007
#define _DSWAKE_DSFLT_MASK                       0x00000080
#define _DSWAKE_DSFLT_LENGTH                     0x00000001

#define _DSWAKE_DSINT0_POSITION                  0x00000008
#define _DSWAKE_DSINT0_MASK                      0x00000100
#define _DSWAKE_DSINT0_LENGTH                    0x00000001

#define _DSGPR0_DSGPR_POSITION                   0x00000000
#define _DSGPR0_DSGPR_MASK                       0x0000FFFF
#define _DSGPR0_DSGPR_LENGTH                     0x00000010

#define _DSGPR0_DSGPR0_POSITION                  0x00000000
#define _DSGPR0_DSGPR0_MASK                      0x00000001
#define _DSGPR0_DSGPR0_LENGTH                    0x00000001

#define _DSGPR0_DSGPR1_POSITION                  0x00000001
#define _DSGPR0_DSGPR1_MASK                      0x00000002
#define _DSGPR0_DSGPR1_LENGTH                    0x00000001

#define _DSGPR0_DSGPR2_POSITION                  0x00000002
#define _DSGPR0_DSGPR2_MASK                      0x00000004
#define _DSGPR0_DSGPR2_LENGTH                    0x00000001

#define _DSGPR0_DSGPR3_POSITION                  0x00000003
#define _DSGPR0_DSGPR3_MASK                      0x00000008
#define _DSGPR0_DSGPR3_LENGTH                    0x00000001

#define _DSGPR0_DSGPR4_POSITION                  0x00000004
#define _DSGPR0_DSGPR4_MASK                      0x00000010
#define _DSGPR0_DSGPR4_LENGTH                    0x00000001

#define _DSGPR0_DSGPR5_POSITION                  0x00000005
#define _DSGPR0_DSGPR5_MASK                      0x00000020
#define _DSGPR0_DSGPR5_LENGTH                    0x00000001

#define _DSGPR0_DSGPR6_POSITION                  0x00000006
#define _DSGPR0_DSGPR6_MASK                      0x00000040
#define _DSGPR0_DSGPR6_LENGTH                    0x00000001

#define _DSGPR0_DSGPR7_POSITION                  0x00000007
#define _DSGPR0_DSGPR7_MASK                      0x00000080
#define _DSGPR0_DSGPR7_LENGTH                    0x00000001

#define _DSGPR0_DSGPR8_POSITION                  0x00000008
#define _DSGPR0_DSGPR8_MASK                      0x00000100
#define _DSGPR0_DSGPR8_LENGTH                    0x00000001

#define _DSGPR0_DSGPR9_POSITION                  0x00000009
#define _DSGPR0_DSGPR9_MASK                      0x00000200
#define _DSGPR0_DSGPR9_LENGTH                    0x00000001

#define _DSGPR0_DSGPR10_POSITION                 0x0000000A
#define _DSGPR0_DSGPR10_MASK                     0x00000400
#define _DSGPR0_DSGPR10_LENGTH                   0x00000001

#define _DSGPR0_DSGPR11_POSITION                 0x0000000B
#define _DSGPR0_DSGPR11_MASK                     0x00000800
#define _DSGPR0_DSGPR11_LENGTH                   0x00000001

#define _DSGPR0_DSGPR12_POSITION                 0x0000000C
#define _DSGPR0_DSGPR12_MASK                     0x00001000
#define _DSGPR0_DSGPR12_LENGTH                   0x00000001

#define _DSGPR0_DSGPR13_POSITION                 0x0000000D
#define _DSGPR0_DSGPR13_MASK                     0x00002000
#define _DSGPR0_DSGPR13_LENGTH                   0x00000001

#define _DSGPR0_DSGPR14_POSITION                 0x0000000E
#define _DSGPR0_DSGPR14_MASK                     0x00004000
#define _DSGPR0_DSGPR14_LENGTH                   0x00000001

#define _DSGPR0_DSGPR15_POSITION                 0x0000000F
#define _DSGPR0_DSGPR15_MASK                     0x00008000
#define _DSGPR0_DSGPR15_LENGTH                   0x00000001

#define _DSGPR1_DSGPR_POSITION                   0x00000000
#define _DSGPR1_DSGPR_MASK                       0x0000FFFF
#define _DSGPR1_DSGPR_LENGTH                     0x00000010

#define _DSGPR1_DSGPR0_POSITION                  0x00000000
#define _DSGPR1_DSGPR0_MASK                      0x00000001
#define _DSGPR1_DSGPR0_LENGTH                    0x00000001

#define _DSGPR1_DSGPR1_POSITION                  0x00000001
#define _DSGPR1_DSGPR1_MASK                      0x00000002
#define _DSGPR1_DSGPR1_LENGTH                    0x00000001

#define _DSGPR1_DSGPR2_POSITION                  0x00000002
#define _DSGPR1_DSGPR2_MASK                      0x00000004
#define _DSGPR1_DSGPR2_LENGTH                    0x00000001

#define _DSGPR1_DSGPR3_POSITION                  0x00000003
#define _DSGPR1_DSGPR3_MASK                      0x00000008
#define _DSGPR1_DSGPR3_LENGTH                    0x00000001

#define _DSGPR1_DSGPR4_POSITION                  0x00000004
#define _DSGPR1_DSGPR4_MASK                      0x00000010
#define _DSGPR1_DSGPR4_LENGTH                    0x00000001

#define _DSGPR1_DSGPR5_POSITION                  0x00000005
#define _DSGPR1_DSGPR5_MASK                      0x00000020
#define _DSGPR1_DSGPR5_LENGTH                    0x00000001

#define _DSGPR1_DSGPR6_POSITION                  0x00000006
#define _DSGPR1_DSGPR6_MASK                      0x00000040
#define _DSGPR1_DSGPR6_LENGTH                    0x00000001

#define _DSGPR1_DSGPR7_POSITION                  0x00000007
#define _DSGPR1_DSGPR7_MASK                      0x00000080
#define _DSGPR1_DSGPR7_LENGTH                    0x00000001

